<?php

// 9の段になった 91827364554637281
// for ($i=1; $i < 10; $i++) {
//   for ($j=1; $j < 10; $j++) {
//     $nums = $i * $j;
//   }
//   echo $nums;
// }


// 1かける１、2かける2、、、になった　149162536496481

// for ($i=1, $j=1; $i < 10, $j < 10; $i++, $j++) {
//     $nums = $i * $j;
//   echo $nums;
// }



// for ($i=1; $i < 10; $i++) {
//   // for ($j=1; $j < 10; $j++) {
//   $j = 1
//   $i = $i * $j;
//   $j++
//   // }
//   echo $i;
// }

// できた！
for ($i=1; $i < 10; $i++) {
  for ($j=1; $j < 10; $j++) {
    echo $i * $j;
  }
}
